In [7]:
import numpy as np
import pandas as pd

In [8]:
df = pd.read_csv('adult.data.csv')

In [9]:
df.describe()

,age,fnlwgt,education-num,capital-gain,capital-loss,hours-per-week
count,32561.000000,3.256100e+04,32561.000000,32561.000000,32561.000000,32561.000000
mean,38.581647,1.897784e+05,10.080679,1077.648844,87.303830,40.437456
std,13.640433,1.055500e+05,2.572720,7385.292085,402.960219,12.347429
min,17.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,28.000000,1.178270e+05,9.000000,0.000000,0.000000,40.000000
50%,37.000000,1.783560e+05,10.000000,0.000000,0.000000,40.000000
75%,48.000000,2.370510e+05,12.000000,0.000000,0.000000,45.000000
max,90.000000,1.484705e+06,16.000000,99999.000000,4356.000000,99.000000

In [10]:
df

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32556,27,Private,257302,Assoc-acdm,12,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K
32557,40,Private,154374,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K
32558,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
32559,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K
32560,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32561 non-null  int64
 1   workclass       32561 non-null  object
 2   fnlwgt          32561 non-null  int64
 3   education       32561 non-null  object
 4   education-num   32561 non-null  int64
 5   marital-status  32561 non-null  object
 6   occupation      32561 non-null  object
 7   relationship    32561 non-null  object
 8   race            32561 non-null  object
 9   sex             32561 non-null  object
 10  capital-gain    32561 non-null  int64
 11  capital-loss    32561 non-null  int64
 12  hours-per-week  32561 non-null  int64
 13  native-country  32561 non-null  object
 14  salary          32561 non-null  object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

In [12]:
df.shape

(32561, 15)

In [13]:
df.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [14]:
#This is how much every race is represented in the dataset
df['race'].value_counts()

race
White                 27816
Black                  3124
Asian-Pac-Islander     1039
Amer-Indian-Eskimo      311
Other                   271
Name: count, dtype: int64

In [15]:
df.value_counts().sum()

32561

In [16]:
(df['sex'].value_counts() * 100) / df.value_counts().sum()

sex
Male      66.920549
Female    33.079451
Name: count, dtype: float64

In [17]:
#Percentage of men
df[df['sex'] =='Male'].value_counts().sum() * 100 / df.value_counts().sum()

66.92054912318417

In [18]:
#The average age of men
df.loc[df['sex'] == 'Male', ['age']].mean()

age    39.433547
dtype: float64

In [19]:
df.value_counts().sum()

32561

In [20]:
#Percentage of people that have Bachelor's Degree
df[df['education'] == 'Bachelors'].value_counts().sum() * 100 / df.value_counts().sum()

16.446055096587944

In [21]:
round(df[df['education'] == 'Bachelors'].value_counts().sum() * 100 / df.value_counts().sum(), 1)

16.4

In [22]:
df[df['salary'] == '>50K'].count()

age               7841
workclass         7841
fnlwgt            7841
education         7841
education-num     7841
marital-status    7841
occupation        7841
relationship      7841
race              7841
sex               7841
capital-gain      7841
capital-loss      7841
hours-per-week    7841
native-country    7841
salary            7841
dtype: int64

In [23]:
#Sum 
df.loc[(df['education'] == 'Bachelors') & (df['salary'] == '>50K')].value_counts().count() * 100 / df.value_counts().sum()

6.8210435797426365

In [24]:
df[['education', 'salary']].sort_values('education')

          education salary
5843           10th  <=50K
20930          10th  <=50K
27263          10th  <=50K
31772          10th  <=50K
30608          10th  <=50K
...             ...    ...
25866  Some-college  <=50K
7509   Some-college  <=50K
7507   Some-college  <=50K
14395  Some-college  <=50K
17283  Some-college  <=50K

[32561 rows x 2 columns]

In [25]:
#Number of employees that have higher education degrees(Bachelors, Masters and Doctorate)
df[df['education'].isin(['Masters', 'Doctorate', 'Bachelors'])].value_counts().sum()

7491

In [26]:
#Percentage of employees that have higher education degrees(Bachelors, Masters and Doctorate)
df[df['education'].isin(['Masters', 'Doctorate', 'Bachelors'])].value_counts().sum() * 100 / df.value_counts().sum()

23.006050182733947

In [27]:
#Number of employees that have lower education degrees
df[~df['education'].isin(['Masters', 'Doctorate', 'Bachelors'])].value_counts().sum()

25070

In [28]:
#Percentage of employees that have lower education degrees
df[~df['education'].isin(['Masters', 'Doctorate', 'Bachelors'])].value_counts().sum()* 100 / df.value_counts().sum()

76.99394981726606

In [29]:
#Number of employees that have higher education degrees(Bachelors, Masters and Doctorate) and make more than 50K
round(df.loc[(df['education'].isin(['Bachelors', 'Masters', 'Doctorate'])) &(df['salary'] == '>50K')].value_counts().count() * 100 / (df['salary'] == '>50K').value_counts().sum(), 1)

10.7

In [30]:
#Percentage of employees that have higher education degrees(Bachelors, Masters and Doctorate) and make less or equal to 50K
df.loc[(df['education'].isin(['Bachelors', 'Masters', 'Doctorate'])) &(df['salary'] == '<=50K')].value_counts().count() * 100 /  (df['salary'] == '>50K').value_counts().sum()

12.290777310279168

In [31]:
#Percentage of employees that have lower education degrees and make more than 50K
df.loc[~(df['education'].isin(['Bachelors', 'Masters', 'Doctorate'])) &(df['salary'] == '>50K')].value_counts().count() * 100 /  df['education'].value_counts().sum()

13.368754030895857

In [32]:
#Percentage of employees that have lower education degrees and make less or equal to 50K
df.loc[~(df['education'].isin(['Bachelors', 'Masters', 'Doctorate'])) &(df['salary'] == '<=50K')].value_counts().count() * 100 / (df['salary'] == '<=50K').value_counts().sum()

63.56070145265809

In [33]:
df['education'].value_counts() * 100 / df.value_counts().sum()

education
HS-grad         32.250238
Some-college    22.391818
Bachelors       16.446055
Masters          5.291607
Assoc-voc        4.244341
11th             3.608612
Assoc-acdm       3.276926
10th             2.865391
7th-8th          1.983969
Prof-school      1.768987
9th              1.578576
12th             1.329812
Doctorate        1.268389
5th-6th          1.022696
1st-4th          0.515955
Preschool        0.156629
Name: count, dtype: float64

In [34]:
df['hours-per-week'].describe()

count    32561.000000
mean        40.437456
std         12.347429
min          1.000000
25%         40.000000
50%         40.000000
75%         45.000000
max         99.000000
Name: hours-per-week, dtype: float64

In [35]:
df['hours-per-week'].max()

99

In [36]:
#Number of people who work the minimum of hours per week and make more than 50K
df.loc[(df['hours-per-week'].min()) & (df['salary'] == '>50K')].value_counts().sum()

7841

In [37]:
#Percentage of people who work the minimum of hours per week and make more than 50K
df.loc[(df['hours-per-week'].min()) & (df['salary'] == '>50K')].value_counts().sum()

7841

In [38]:
 # What country has the highest percentage of people that earn >50K?
df[df['salary'] == '>50K'].groupby('native-country').size().idxmax()

'United-States'

In [39]:
df[(df['native-country'] == 'United-States') & (df['salary'] == '>50K')].count()

age               7171
workclass         7171
fnlwgt            7171
education         7171
education-num     7171
marital-status    7171
occupation        7171
relationship      7171
race              7171
sex               7171
capital-gain      7171
capital-loss      7171
hours-per-week    7171
native-country    7171
salary            7171
dtype: int64

In [40]:
(df[df['salary'] == '>50K'].groupby('native-country').size() / df.groupby('native-country').size()).loc[lambda x: x.idxmax()] * 100

41.86046511627907

In [41]:
import math
round((df[df['salary'] == '>50K'].groupby('native-country').size() / df.groupby('native-country').size()).loc[lambda x: x.idxmax()] * 100, 1)

41.9

In [42]:
df['native-country'].value_counts()

native-country
United-States                 29170
Mexico                          643
?                               583
Philippines                     198
Germany                         137
Canada                          121
Puerto-Rico                     114
El-Salvador                     106
India                           100
Cuba                             95
England                          90
Jamaica                          81
South                            80
China                            75
Italy                            73
Dominican-Republic               70
Vietnam                          67
Guatemala                        64
Japan                            62
Poland                           60
Columbia                         59
Taiwan                           51
Haiti                            44
Iran                             43
Portugal                         37
Nicaragua                        34
Peru                             31
France                           29
Greece                           29
Ecuador                          28
Ireland                          24
Hong                             20
Cambodia                         19
Trinadad&Tobago                  19
Laos                             18
Thailand                         18
Yugoslavia                       16
Outlying-US(Guam-USVI-etc)       14
Honduras                         13
Hungary                          13
Scotland                         12
Holand-Netherlands                1
Name: count, dtype: int64

In [43]:
#The most popular occupation for those who earn more than 50K in India
df[(df['native-country'] == 'India') & (df['salary'] == '>50K')].groupby(df['occupation']).size().sort_values(ascending=False).reset_index(name='Most popular occupation of those who earn more than 50K')

         occupation  Most popular occupation of those who earn more than 50K
0    Prof-specialty                                                 25
1   Exec-managerial                                                  8
2     Other-service                                                  2
3      Tech-support                                                  2
4      Adm-clerical                                                  1
5             Sales                                                  1
6  Transport-moving                                                  1

In [44]:
df[(df['salary'] == '>50K') & (df['native-country'] == 'India')].groupby('occupation').size().idxmax()

'Prof-specialty'

In [45]:
df[df['salary'] == '>50K'].groupby(df['native-country']).value_counts().sum()

7841

In [46]:
df.loc[df['salary'] == '>50K'].groupby(df['native-country']).size().sort_values(ascending=False).to_frame() * 100 / df[df['salary'] == '>50K'].value_counts().sum()

                            0
native-country
United-States       91.455172
?                    1.862007
Philippines          0.777962
Germany              0.561153
India                0.510139
Canada               0.497386
Mexico               0.420865
England              0.382604
Italy                0.318837
Cuba                 0.318837
Japan                0.306083
China                0.255070
Taiwan               0.255070
Iran                 0.229563
South                0.204056
Poland               0.153042
France               0.153042
Puerto-Rico          0.153042
Jamaica              0.127535
El-Salvador          0.114781
Greece               0.102028
Cambodia             0.089274
Yugoslavia           0.076521
Hong                 0.076521
Ireland              0.063767
Vietnam              0.063767
Ecuador              0.051014
Haiti                0.051014
Portugal             0.051014
Scotland             0.038260
Thailand             0.038260
Hungary              0.038260
Guatemala            0.038260
Laos                 0.025507
Dominican-Republic   0.025507
Peru                 0.025507
Trinadad&Tobago      0.025507
Columbia             0.025507
Nicaragua            0.025507
Honduras             0.012753

In [47]:
df.loc[(df['salary'] == '>50K')].groupby(df['native-country']).size().sort_values(ascending=False).reset_index(name='number of them that earn more than 50K')

        native-country  number of them that earn more than 50K
0        United-States                                    7171
1                    ?                                     146
2          Philippines                                      61
3              Germany                                      44
4                India                                      40
5               Canada                                      39
6               Mexico                                      33
7              England                                      30
8                Italy                                      25
9                 Cuba                                      25
10               Japan                                      24
11               China                                      20
12              Taiwan                                      20
13                Iran                                      18
14               South                                      16
15              Poland                                      12
16              France                                      12
17         Puerto-Rico                                      12
18             Jamaica                                      10
19         El-Salvador                                       9
20              Greece                                       8
21            Cambodia                                       7
22          Yugoslavia                                       6
23                Hong                                       6
24             Ireland                                       5
25             Vietnam                                       5
26             Ecuador                                       4
27               Haiti                                       4
28            Portugal                                       4
29            Scotland                                       3
30            Thailand                                       3
31             Hungary                                       3
32           Guatemala                                       3
33                Laos                                       2
34  Dominican-Republic                                       2
35                Peru                                       2
36     Trinadad&Tobago                                       2
37            Columbia                                       2
38           Nicaragua                                       2
39            Honduras                                       1

In [48]:
df.loc[(df['salary'] == '>50K')].groupby(df['native-country']).size().reset_index(name='number of employees').sort_values('number of employees', ascending=False)

        native-country  number of employees
37       United-States                 7171
0                    ?                  146
28         Philippines                   61
11             Germany                   44
18               India                   40
2               Canada                   39
25              Mexico                   33
9              England                   30
21               Italy                   25
5                 Cuba                   25
23               Japan                   24
3                China                   20
34              Taiwan                   20
19                Iran                   18
33               South                   16
29              Poland                   12
10              France                   12
31         Puerto-Rico                   12
22             Jamaica                   10
8          El-Salvador                    9
12              Greece                    8
1             Cambodia                    7
39          Yugoslavia                    6
16                Hong                    6
20             Ireland                    5
38             Vietnam                    5
7              Ecuador                    4
14               Haiti                    4
30            Portugal                    4
32            Scotland                    3
35            Thailand                    3
17             Hungary                    3
13           Guatemala                    3
24                Laos                    2
6   Dominican-Republic                    2
27                Peru                    2
36     Trinadad&Tobago                    2
4             Columbia                    2
26           Nicaragua                    2
15            Honduras                    1